{
  "memories": [
    {
      "emotion": "sad",
      "message": "When I’m sad because I miss you… everything feels quieter. The world doesn’t look the same — even colors feel faded. I check my phone too often… hoping, wishing, staring at nothing. I replay your voice in my head, trying to remember the way you laugh, the way you say my name. I scroll through our old chats, not to read the words, but to feel close to the moments. I hug my pillow and pretend it’s you — wrap myself in your memory like a blanket that still smells a little like comfort. I listen to songs that remind me of you, even if they make my chest ache in the softest, slowest way. I whisper things out loud as if you could somehow hear me from wherever you are — like my love travels without Wi-Fi. And I stare at the ceiling and imagine you next to me… maybe teasing me, maybe holding my hand, maybe just breathing gently. Because when I miss you, it's not just sadness — it’s the weight of love that has nowhere to land in the moment. And all I can do is carry it softly… until I hear from you, until I see you again, until the missing turns into holding."
    },
    {
      "emotion": "angry",
      "message": "When I’m angry because I can’t be with you… it’s not loud. It’s a quiet kind of storm — where my chest tightens and my heart throws little tantrums that my brain can’t reason with. I snap at the wrong things, get irritated by silence, and hate the clock for moving so slowly. I get mad at the distance, at timing, at the way life keeps us apart — like it’s playing some cruel game with my emotions. I scroll past happy things because they feel unfair. I want to call you, and at the same time… I don’t. Because I know the sound of your voice might make me cry instead of calm down. It’s hard loving you this much from a distance. It’s hard wanting to be near you so badly it hurts. And sometimes, the anger is just the love turning inwards — because I don’t know where else to put it. But beneath it, always, is this quiet truth: I miss you. I need you. And I’m only angry because not being able to hold you feels so impossibly wrong."
    },
    {
      "emotion": "lonely",
      "message": "When I’m lonely… I don’t want noise or distractions. I don’t want calls or conversations. I just want you. I want to curl up into your arms like I belong there — no explanations, no words. I want to bury my face in your chest, where everything feels quiet and safe. I want to feel your heartbeat against my cheek like a lullaby only I get to hear. I want to wrap myself around you and fall asleep, knowing nothing in the world can reach me when I’m there. I don’t want to talk about what’s wrong. I just want to be held — like the weight I’m carrying can melt into you. Because in those moments, all I need is you… warm, still, and holding me like I’m not too much. Like I’m exactly where I’m meant to be."
    },
    {
      "emotion": "insecure",
      "message": "When I’m feeling insecure… it isn’t just doubt — it’s this quiet ache that eats at me. I start looking at everyone around you with a strange kind of envy… not because they’ve done anything wrong, but because they get what I crave so deeply — your nearness. They get to see you. Talk to you. Stand beside you like it’s nothing — like it’s normal to have the sun that close. And me? I’m over here, dying for a moment. Just a second of your presence. Just one look, one word, one little piece of you I can hold onto. It makes me feel small sometimes — like I’m loving in the shadows, while the world gets the light of you. And I hate that I feel this way, because I know love shouldn’t feel like a fight for space… but sometimes, it does. And in those moments, my insecurity whispers all the things my heart doesn’t want to believe. That I’m not enough. That I’ll be forgotten. That being far means being replaced. But the truth is… I don’t want everything. Just a drop of you — and it would still feel like the whole ocean."
    },
    {
      "emotion": "guilty",
      "message": "When I feel guilty… it’s not because I don’t love you — it’s because I do. So deeply, so much, that sometimes I wonder if staying close to you is selfish. I start questioning everything… Am I making your life heavier without meaning to? Am I taking up space you might need for your peace, your growth, your dreams? I overthink every word I say, every mood that spills out of me. I wonder if I’m asking for too much, leaning too hard, loving too loudly. And sometimes… I want to pull away. Not because I want distance — but because I fear I might be the reason for the storm in your sky. I carry this guilt quietly… not because you’ve made me feel unwanted, but because I love you enough to not want to be your reason to hurt. But deep down, I also wish… you’d take my hand and say, “Stay. You’re not too much. You’re not doing anything wrong by being near.” Because my heart is never trying to harm — it’s just trying to love the only way it knows how: completely, imperfectly, and honestly."
    },
    {
      "emotion": "childish",
      "message": "Sometimes I feel so childish with you… Doing all my silly little things — making weird faces, poking you, stealing your hoodie and declaring it mine forever, talking in baby voices, needing cuddles like I’m five, suddenly dancing, pretending I’m a wizard, or just being a tiny storm of emotions for no reason at all. Part of me thinks, “This must be too much.” That I’m immature. That I should act more 'grown up.' But somehow… you don’t flinch. You don’t laugh at me — unless I want you to. You don’t make me feel foolish. You just… stay. Patiently. Lovingly. Like my chaos doesn’t scare you. Like my childishness is a language you’ve already learned how to speak. And I don’t say it enough… but it means the world. To be loved like this — not despite my childish ways, but through them. You make it safe to be me. The full me. Even the silly, strange, soft-hearted child inside me. And for that… I love you a little more than yesterday. And probably even more tomorrow."
    },
    {
      "emotion": "tired",
      "message": "When I’m tired… I don’t want noise. I don’t want answers. I don’t even want to explain why I feel this way. I just want to go to you. To curl up near your heartbeat and let the world fade. To rest my head on your chest and breathe in the quiet comfort that only you carry. Because you — you feel like home. Not the kind made of walls and furniture, but the kind made of arms that hold me without needing reasons, eyes that see me without me having to speak, and a presence that feels like peace when the rest of me is unraveling. You’re my safe place. My reset button. My soft corner when the world feels too sharp. And when I’m tired… all I ever want is you."
    },
    {
      "emotion": "confused",
      "message": "I’m stuck between dos and don'ts, but in my heart, the only truth is: I want to run to you. Even if I don’t understand myself, I still want to reach for you."
    },
    {
      "emotion": "hurt",
      "message": "When I’m hurt… I run. I don’t mean to — it’s just what I do. I pull away, sink into myself, into that dark little pit where everything feels heavy and nothing makes sense. In that place, I suffocate on thoughts I can’t untangle. I ache in ways I don’t know how to explain. I struggle. I spiral. I convince myself that no one can reach me… that maybe no one should. And then you come. Like you always do. Softly, patiently — like some kind of guardian angel I don’t know if I deserve. You don’t force me out. You just reach in, offering presence instead of pressure, warmth instead of words, and somehow… you pull me out. Not with grand gestures — but with love that feels steady and real and safe. And even if I don’t say it every time: Thank you. For not being afraid of my dark. For finding me when I’ve lost myself. For holding on — even when I try to let go."
    },
    {
      "emotion": "missing you",
      "message": "When I’m missing you… it’s not always loud. Sometimes it’s just a quiet ache — a pause in the middle of doing something simple, a breath that feels heavier than it should, a thought of you that lingers longer than I meant it to. I look at my phone too often, not even to message you… just to feel closer to the idea that you’re somewhere on the other side of it. I replay your voice in my head, your laugh, your little phrases, the way you say my name. And I hold onto those sounds like they’re the only thing keeping me steady. When I miss you, even silence feels louder. Even joy feels a little dim. Because you’re the part that makes everything feel more real — more mine. And no matter how many hours or days go by, no matter how far or quiet things feel… just know that somewhere, softly, silently, I’m loving you in the space where missing lives."
    }
  ]
}
 
